#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+EXPORT_FILE_NAME: ../html/newton.html
#+OPTIONS: broken-links:t
#+TITLE: Calculating square roots with generators
This chapter shows how to decompose a complex loop into re-usable components, by chaining functions together. This pattern is most powerful when the functions evaluate lazily. In Python, it means that they should be written as generators.

* The math bit
To approximate sqrt(n), we start with an initial value =x=, and apply (x + n/x) / 2.0 repeatedly.
=next_sqrt_approx(n)= returns a closure that brings its input closer to sqrt(n).
#+begin_src python :noweb no-export :tangle ../src/newton.py
  <<NEWTON_IMPORTS>>

  def next_sqrt_approx(n: float) -> Callable[[float], float]:
      """Next step in the approximation of sqrt(n) from x"""
      def next_approx_(x: float) -> float:
          return (x + n / x) / 2.0
      return next_approx_  
#+end_src

A example call: one single iteration in the approximation of sqrt(10.0) from 2.0.
#+begin_src python :exports both :noweb no-export :results value :dir ../src/
  <<DEMO_IMPORTS>>
  f = next_sqrt_approx(10.0)
  return f(2.0)
#+end_src

#+RESULTS:
: 3.5

* Add a stopping condition
We add a =within= function to stop the iteration when the difference between two successive iterations is smaller than =esp=. Note that it doesn't catch =StopIteration= because it's written for infinite iterators.
#+begin_src python :noweb yes :tangle ../src/lazy_utils.py
  def within(esp: float, itr: Iterator[float]) -> Iterator[float]:
      """Stop if the next two iterations have a small delta."""
      a = next(itr)
      while True:
          b = next(itr)
          if abs(a - b) <= esp:
              yield b
          else:
              a = b
#+end_src

Now we can solve our numerical problem:
#+begin_src python :noweb yes :tangle ../src/newton.py
  def newton_sqrt(n: float, a: float) -> float:
      """Approximate sqrt(n) starting from a, using the Newton-Raphson method."""
      r = within(0.00001, repeat_f(next_sqrt_approx(n), a))
      return next(r)
#+end_src

A simple test:
#+begin_src python :exports both :noweb no-export :results value :dir ../src/
  <<DEMO_IMPORTS>>
  return newton_sqrt(10.0, 2.0)
#+end_src

#+RESULTS:
: 3.162277660168379

#+begin_src python :noweb yes :tangle ../src/test_newton.py
  def test_newton_sqrt():
      res = newton_sqrt(10.0, 2.0)
      assert res == pytest.approx(math.sqrt(10.0))
#+end_src

